app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers"
---
  def index
    @offers = Offer.all

INSERT INTO "offers" ("name", "url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lucas Ramos"], ["url", "https://lucasramos.com.br"], ["description", "123123"], ["created_at", "2020-03-07 16:22:18.591256"], ["updated_at", "2020-03-07 16:22:18.591256"]]
---
  def create
    @offer = Offer.new(offer_params)

    respond_to do |format|
      if @offer.save

UPDATE "offers" SET "description" = $1, "updated_at" = $2 WHERE "offers"."id" = $3  [["description", "asdadadsasd asdasdasdasd"], ["updated_at", "2020-03-07 17:32:23.441093"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @offer.update(offer_params)

DELETE FROM "offers" WHERE "offers"."id" = $1  [["id", 2]]
---
  def destroy
    @offer.destroy

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_offer
      @offer = Offer.find(params[:id])